{
  "referrals": [
    {
      "creationDate": "2018-11-05T00:00:00.000-05:00",
      "display": true,
      "entryDate": "2019-10-09T00:00:00.000-05:00",
      "grade": 672,
      "id": "3122",
      "lastUpdated": "2019-11-05T00:00:00.000-05:00",
      "name": "Sébastien CHA",
      "notificationSent": true,
      "otherViolation": "Ce livre sur les fondamentaux du langage Python 3 (en version 3.8 beta au moment de l'écriture) s'adresse à tout professionnel de l'informatique, ingénieur, étudiant (et particulièrement en BTS Services Informatiques Organisations), enseignant ou même autodidacte, qui souhaite maîtriser ce langage très abouti. Il couvre un périmètre relativement large, détaille tout le cœur du langage et du traitement de données et ouvre des perspectives importantes sur tout ce que Python 3 permet de faire (de la création d'un site web au développement de jeux en passant par la conception d'une interface graphique avec Gtk). Le livre est consacré à la branche 3 de Python, et présente bien sûr les nouveautés apportées par la version 3.8. Toutefois, comme le langage Python 2 est encore très présent, lorsqu'elles existent, l'auteur présente les différences importantes avec la branche antérieure de Python.",
      "processed": true,
      "school": "Les fondamentaux du langage",
      "schoolYear": 2020,
      "teacher": "Python 3",
      "violation": "Informatique"
    },
    {
      "creationDate": "2018-11-05T00:00:00.000-05:00",
      "display": true,
      "entryDate": "2019-10-09T00:00:00.000-05:00",
      "grade": 302,
      "id": "3122",
      "lastUpdated": "2019-11-05T00:00:00.000-05:00",
      "name": "Dunod emna",
      "notificationSent": true,
      "otherViolation": "La mécanique des roches est une discipline relativement jeune qui relève à la fois des Sciences de la terre et de la Mécanique des milieux continus ou discontinus.\n\nElle vise à décrire le comportement des roches en fonction des sollicitations extérieures ou, dans le cas de l'application aux structures du génie civil, du type d'ouvrage qui sera construit.\n\nLa majorité des géotechniciens qui travaillent dans le domaine du génie civil sont des mécaniciens des sols. Or, une roche n'est pas un sol ; les outils sont donc spécifiques et souvent mal connus.\n\nL'objectif de ce livre est de détailler les principes permettant de décrire le plus correctement possible les massifs rocheux, afin de proposer des solutions de dimensionnement des ouvrages scientifiquement fiables.",
      "processed": true,
      "school": "Les fondamentaux du langage",
      "schoolYear": 2020,
      "teacher": "Mécanique des roches",
      "violation": " Génie civil"
    }
  ],
  "currentMarkingPeriod": {
    "id": "462",
    "name": "Sem1GradeBook",
    "selected": true,
    "year": 2018
  },
  "markingPeriodYears": [
    2013,
    2014,
    2015,
    2016,
    2017,
    2018,
    2019
  ],
  "markingPeriods": [
    {
      "id": "462",
      "name": "Sem1GradeBook",
      "selected": true,
      "year": 2018
    },
    {
      "id": "461",
      "name": "Sem2GradeBook",
      "selected": false,
      "year": 2018
    }
  ]
}